js/app/templates/run-scene.hbs

<s:Envelope s:encodingStyle="http://schemas.xmlsoap.org/soap/encoding/"
            xmlns:s="http://schemas.xmlsoap.org/soap/envelope/">
    <s:Body>
        <u:RunScene xmlns:u="urn:schemas-micasaverde-org:service:HomeAutomationGateway:1">
            <SceneNum>{{ scene_number }}</SceneNum>
        </u:RunScene>
    </s:Body>
</s:Envelope>
